Revit 2027 API
AnalysisDisplayStyle.GetVectorSettings Method
 Get vector settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayVectorSettings GetVectorSettings()
Public Function GetVectorSettings As AnalysisDisplayVectorSettings
public:
AnalysisDisplayVectorSettings^ GetVectorSettings()
member GetVectorSettings : unit -> AnalysisDisplayVectorSettings
Return Value
AnalysisDisplayVectorSettings
Exceptions
Exception | Condition
InvalidOperationException |  vector settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace